public class Main {
    public static void main(String[] args) {

        /* 4 варианта для проверки:
        1. ОК
        2. Размерность массива меньше
        3. Формат одной из ячеек неправильный
        4. Размерность массива больше
         */
        String[][][] arr = {
                {
                        {"10", "10", "10", "10"},
                        {"10", "10", "10", "10"},
                        {"10", "10", "10", "10"},
                        {"10", "10", "10", "10"}
                },
                {
                        {"10", "10", "10", "10"},
                        {"10", "10", "10", "10"},
                        {"10", "10", "10"},
                        {"10", "10", "10", "10"}
                },
                {
                        {"10", "10", "10", "10"},
                        {"10", "10", "10", "10"},
                        {"10", "10.0", "10", "10"},
                        {"10", "10", "10", "10"}
                },
                {
                        {"10", "10", "10", "10"},
                        {"10", "10", "10", "10"},
                        {"10", "10", "10", "10", "10"},
                        {"10", "10", "10", "10"}
                }
        };


        ExceptionTest excTest = new ExceptionTest();    // Создание "рабочего тела"
        for (String[][] strings : arr) {
            try {
                excTest.sum(strings);                   // Вызов метода суммирования
                System.out.println(excTest.getSum());   // Распечатка суммы

            } catch (MyArrayDataException | MyArraySizeException e) {
                System.out.println(e);
            }

        }
    }
}
